# GetMinimumLayerThickness Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetMinimumLayerThickness Method
CompoundStructure Class See Also
---
Get the minimum allowable layer thickness.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static double GetMinimumLayerThickness()
```

Visual Basic
---
```text
Public Shared Function GetMinimumLayerThickness As Double
```

Visual C++
---
```text
public:
static double GetMinimumLayerThickness()
```

# ### Return Value
The minimum allowable width of a layer in feet.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace